:PROPERTIES:
:header-args: :tangle no :mkdirp yes :results output silent :no-expand t
:END:
*** I
#+begin_src eshell :tangle no :dir /home/buyn/Dev/ClojureScript/grom.org
tree -I "node_modules|.venv|__pycache__|public/js"

 #+end_src

 #+RESULTS:
 #+begin_example
 .
 ├── grom.org
 ├── package.json
 ├── package-lock.json
 ├── public
 │   ├── css
 │   │   └── style.css
 │   └── index.html
 ├── README.md
 ├── README.md~1
 ├── resources
 │   └── public
 ├── shadow-cljs.edn
 └── src
     └── ueava
         └── core.cljs

 7 directories, 9 files
 #+end_example


**** src shadow-cljs.edn
#+begin_src clojure :no-expand t :mkdirp yes
{:source-paths ["src"]

 :dependencies [[binaryage/devtools "0.9.10"]
                [proto-repl "0.3.1"]
                [reagent "0.8.0"]
                [cljs-ajax "0.7.3"]]

 :nrepl        {:port 3333}

 :builds
 {:app {:target :browser
        :output-dir "public/js"
        :asset-path "/js"

        :modules
        {:main
         {:entries [giggin.core]}}

        :devtools
        {:after-load  giggin.core/main
         :http-root   "public"
         :http-port   3000}}

  :test {:target :node-test
           :output-to "out/node-tests.js"
           ;; :ns-regexp "-test$" ; по умолчанию
           ;; :autorun false
           }}}


#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
**** src package.json
#+begin_src json :no-expand t :mkdirp yes
{
  "name": "Grom.Org",
  "version": "0.0.1",
  "description": "Grom.Org - find a gig!",
  "repository": "https://github.com/jacekschae/learn-reagent-course-files.git",
  "private": true,
  "scripts": {
    "dev": "shadow-cljs watch app",
    "release": "shadow-cljs release app",
    "clean": "rm -rf target && rm -rf public/js",
    "clean-win": "rmdir /s /q public/js & rmdir /s /q target"
  },
  "devDependencies": {
    "shadow-cljs": "^2.27.5"
  },
  "dependencies": {
    "firebase": "^10.7.1",
    "react": "^18.2.0",
    "react-dom": "^18.2.0",
    "create-react-class": "^15.7.0"
  }
}


#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
**** src state.cljs
#+begin_src clojure :no-expand t :mkdirp yes
(ns giggin.state
  (:require [reagent.core :as r]))


(defn gigs-cursor [app]
  (r/cursor app [:gigs]))

(defn orders-cursor [app]
  (r/cursor app [:orders]))

(defn gig-editor-cursor [app]
  (r/cursor app [:gig-editor]))

(def app-state (r/atom {
                :orders {}
                :gig-editor {
                     :modal false
                     :values {:id (str "gig-" (random-uuid))
                               :title "" :desc "" :price 0 :img "" :sold-out false}}
                :gigs {
                   :gig-01 {:id :gig-01
                            :title "Macaron"
                            :artist "Baher Khairy"
                            :desc "Sweet meringue-based rhythms with smooth and sweet injections of soul"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/baher-khairy-97645.jpg"
                            :price 1000
                            :sold-out false}
                   :gig-02 {:id :gig-02
                            :title "Stairs"
                            :artist "Brentr De Ranter"
                            :desc "Stairs to the highets peaks of music."
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/brent-de-ranter-426248.jpg"
                            :price 2000
                            :sold-out false}
                   :gig-03 {:id :gig-03
                            :title "Infusion"
                            :artist "Camille Couvez"
                            :desc "Introduction of a new elements of music into modern world"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/camille-couvez-424606.jpg"
                            :price 3000
                            :sold-out false}
                   :gig-04 {:id :gig-04
                            :title "Books"
                            :artist "Cesar-Viteri"
                            :desc "A book of music, exploring different music genres across last decade"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/cesar-viteri-426877.jpg"
                            :seats 40
                            :price 4000
                            :sold-out false}
                   :gig-05 {:id :gig-05
                            :title "White"
                            :artist "Dan Schiumarini"
                            :desc "Vulnerability and humility exposed with Raps of Dan Schiumarini"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/dan-schiumarini-427769.jpg"
                            :price 5000
                            :sold-out false}
                   :gig-06 {:id :gig-06
                            :title "Hustin'"
                            :artist "Frank Cordoba"
                            :desc "Story of Hip Hop hustle by Frank Cordoba"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/frank-cordoba-425264.jpg"
                            :price 6000
                            :sold-out false}
                   :gig-07 {:id :gig-07
                            :title "Pumping"
                            :artist "Jakob Owens"
                            :desc "Get energized and ready to rock with this fresh and bright work of Jakob Owens"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/jakob-owens-393298.jpg"
                            :price 7000
                            :sold-out false}
                   :gig-08 {:id :gig-08
                            :title "Lion"
                            :artist "Jakob Puff"
                            :desc "An album of wild and brave sounds explored by Jakob Puff"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552695/giggin/jakob-puff-425634.jpg"
                            :price 8000
                            :sold-out false}
                   :gig-09 {:id :gig-09
                            :title "ampersand"
                            :artist "Kirstyn Paynter"
                            :desc "Connect music and words with ampersand and enjoy find out what happens next"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552696/giggin/kirstyn-paynter-424217.jpg"
                            :price 9000
                            :sold-out false}
                   :gig-10 {:id :gig-10
                            :title "Taxi"
                            :artist "Peter Kasprzyk"
                            :desc "Taka a Taxi ride with Peter to explore different beats of the city"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552696/giggin/peter-kasprzyk-111462.jpg"
                            :price 9000
                            :sold-out false}
                   :gig-11 {:id :gig-11
                            :title "Plaza De La Juderia"
                            :artist "Quino Al"
                            :desc "Spanish rhythms from Plaza De La Juderia"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552696/giggin/quino-al-427620.jpg"
                            :price 9000
                            :sold-out false}
                   :gig-12 {:id :gig-12
                            :title "Girl"
                            :artist "Shine Tang"
                            :desc "Shine Tang offers a grand exploration of classical music"
                            :img "https://res.cloudinary.com/schae/image/upload/f_auto,q_auto/v1519552696/giggin/shine-tang-425878.jpg"
                            :price 9000
                            :sold-out false}}}))


#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
**** src helpers.cljs
#+begin_src clojure :no-expand t :mkdirp yes
(ns giggin.helpers)

(defn format-price
  "convert cens to evro"
  [cents]
  (str "$" (/ cents 100)))



#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
**** src api.cljs
#+begin_src clojure :no-expand t :mkdirp yes
(ns giggin.api
  (:require [ajax.core :refer [GET]]))

(defn index-by
  [key coll]
  "Transfomr a coll to a map with a given key as a lookup value"
  (->> coll
       ;; (map (juxt key identity))
       (map (juxt #(keyword (key %)) identity))
       (into {})))

(defn handler [gigs response]
  (reset! gigs (index-by :id response)))

(defn error-handler [{:keys [status status-text]}]
  (.log js/console (str "something bad happened: " status " " status-text)))

(defn fetch-gigs
  [gigs]
  (GET "https://gist.githubusercontent.com/jacekschae/8c10aa58a6163905fffcec33dd6f5a01/raw/20874f73b2c1d0ad08d828131d6ea8392950780a/gigs.json"
       {:handler #(handler gigs %)
        :error-handler error-handler
        :response-format :json
        :keywords? true}))


#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
***** block 01
#+begin_src clojure :tangle no
(require '[ajax.core :refer [GET]])

(defonce gigs-atom (atom nil))

(defn handler [response]
  (reset! gigs-atom response)
  (js/console.log "gigs loaded:" response))

(defn error-handler [{:keys [status status-text]}]
  (.log js/console (str "something bad happened: " status " " status-text))
  (println "get erros - ")
  (println (str "something bad happened: " status " " status-text)))

(defn fetch-gigs
  []
  (GET "https://gist.githubusercontent.com/jacekschae/8c10aa58a6163905fffcec33dd6f5a01/raw/20874f73b2c1d0ad08d828131d6ea8392950780a/gigs.json"
       {:handler handler
        :error-handler error-handler
        :response-format :json
        :keywords? true}))

#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected

**** src header.cljs
#+begin_src clojure :no-expand t :mkdirp yes
(ns giggin.components.header)

(defn header
  []
  [:header
   [:div {:display "flex"}
    ;; [:img.logo { :src "img/portal-logo.jpg"
    ;;             :alt "Poratl logo"}]
    [:img      { :src "img/portal-logo-title.jpg"
                  :alt "Poratl title logo"}]]])

#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
**** src checkout_modal.cljs
#+begin_src clojure :no-expand t :mkdirp yes
(ns giggin.components.checkout-modal
  (:require [reagent.core :as r]))

(defn checkout-modal
  []
  (let [modal (r/atom false)
        toggle-modal #(reset! modal %)]
    (fn
      []
      [:div.checkout-modal
       [:button.btn.btn--secondary
        {:on-click #(toggle-modal true)
         :style {:width "100%"}}
        "Checkout"]
       [:div.modal (when @modal {:class "active"})
        [:div.modal__overlay]
        [:div.modal__container
         [:div.modal__body
          [:div.payment
           [:img.payment-logo {:src "/img/paypal.svg" :alt "Paypal logo"}]
           [:img.payment-logo {:src "/img/stripe.svg" :alt "Stripe logo"}]]]
         [:div.modal__footer
          [:button.btn.btn--link.float--left
           {:on-click #(toggle-modal false)}
           "Cancel"]]]]])))



#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
**** 01
#+begin_src eshell :dir /home/buyn/Dev/ClojureScript/tutorials/learn-reagent-course-files/increments/
diff -r 16-update-gig 17-refactor-gigs
#+end_src

#+RESULTS:
#+begin_example
diff -r 16-update-gig/src/giggin/components/gig_editor.cljs 17-refactor-gigs/src/giggin/components/gig_editor.cljs
13,14c13,14
<   [modal values insert-gig]
<   [:div.modal (when @modal {:class "active"})
---
>   [modal values upsert-gig toggle-modal]
>   [:div.modal (when (:active @modal) {:class "active"})
43c43
<       {:on-click #(reset! modal false)}
---
>       {:on-click #(toggle-modal {:active false :gig {}})}
46c46
<       {:on-click #(insert-gig @values)}
---
>       {:on-click #(upsert-gig @values)}
diff -r 16-update-gig/src/giggin/components/gigs.cljs 17-refactor-gigs/src/giggin/components/gigs.cljs
10,11c10,11
<   (let [modal (r/atom false)
<         values (r/atom {:id (str "gig-" (random-uuid)) :title "" :desc "" :price 0 :img "" :sold-out false})
---
>   (let [modal (r/atom {:active false})
>         values (r/atom {:id nil :title "" :desc "" :price 0 :img "" :sold-out false})
13,14c13,18
<         insert-gig (fn [{:keys [id title desc price img sold-out]}]
<                      (swap! state/gigs assoc id {:id id
---
>         toggle-modal (fn
>                        [{:keys [active gig]}]
>                        (swap! modal assoc :active active)
>                        (reset! values gig))
>         upsert-gig (fn [{:keys [id title desc price img sold-out]}]
>                      (swap! state/gigs assoc id {:id (or id (str "gig-" (random-uuid)))
20c24
<                      (reset! modal false))]
---
>                      (toggle-modal {:active false :gig {}}))]
26c30
<          {:on-click #(reset! modal true)}
---
>          {:on-click #(toggle-modal {:active true :gig {}})}
30,31c34,35
<         [gig-editor modal values insert-gig]
<         (for [{:keys [id img title price desc]} (vals @state/gigs)]
---
>         [gig-editor modal values upsert-gig toggle-modal]
>         (for [{:keys [id img title price desc] :as gig} (vals @state/gigs)]
33c37,40
<            [:img.gig__artwork {:src img :alt title}]
---
>            [:img.gig__artwork.gig__edit {:src img
>                                          :alt title
>                                          :on-click #(toggle-modal {:active true
>                                                                    :gig gig})}]
#+end_example


**** 02
#+begin_src eshell
cd /home/buyn/Dev/ClojureScript/tutorials/learn-reagent-course-files/increments/
diff -r 16-update-gig 17-refactor-gigs
#+end_src

#+RESULTS:
#+begin_example
diff -r 16-update-gig/src/giggin/components/gig_editor.cljs 17-refactor-gigs/src/giggin/components/gig_editor.cljs
13,14c13,14
<   [modal values insert-gig]
<   [:div.modal (when @modal {:class "active"})
---
>   [modal values upsert-gig toggle-modal]
>   [:div.modal (when (:active @modal) {:class "active"})
43c43
<       {:on-click #(reset! modal false)}
---
>       {:on-click #(toggle-modal {:active false :gig {}})}
46c46
<       {:on-click #(insert-gig @values)}
---
>       {:on-click #(upsert-gig @values)}
diff -r 16-update-gig/src/giggin/components/gigs.cljs 17-refactor-gigs/src/giggin/components/gigs.cljs
10,11c10,11
<   (let [modal (r/atom false)
<         values (r/atom {:id (str "gig-" (random-uuid)) :title "" :desc "" :price 0 :img "" :sold-out false})
---
>   (let [modal (r/atom {:active false})
>         values (r/atom {:id nil :title "" :desc "" :price 0 :img "" :sold-out false})
13,14c13,18
<         insert-gig (fn [{:keys [id title desc price img sold-out]}]
<                      (swap! state/gigs assoc id {:id id
---
>         toggle-modal (fn
>                        [{:keys [active gig]}]
>                        (swap! modal assoc :active active)
>                        (reset! values gig))
>         upsert-gig (fn [{:keys [id title desc price img sold-out]}]
>                      (swap! state/gigs assoc id {:id (or id (str "gig-" (random-uuid)))
20c24
<                      (reset! modal false))]
---
>                      (toggle-modal {:active false :gig {}}))]
26c30
<          {:on-click #(reset! modal true)}
---
>          {:on-click #(toggle-modal {:active true :gig {}})}
30,31c34,35
<         [gig-editor modal values insert-gig]
<         (for [{:keys [id img title price desc]} (vals @state/gigs)]
---
>         [gig-editor modal values upsert-gig toggle-modal]
>         (for [{:keys [id img title price desc] :as gig} (vals @state/gigs)]
33c37,40
<            [:img.gig__artwork {:src img :alt title}]
---
>            [:img.gig__artwork.gig__edit {:src img
>                                          :alt title
>                                          :on-click #(toggle-modal {:active true
>                                                                    :gig gig})}]
#+end_example
**** dropbox in org
#+begin_src sh  
grep --include=\*.cljs -rnw ./ -e ":todos-by-status"
#+end_src       

#+RESULTS:
| ./src/keechma_todomvc/components/todo_list.cljs:18:-                     | `:todos-by-status` | returns           | `todos`         | with  | a   | `status`         |                    |
| ./src/keechma_todomvc/components/todo_list.cljs:26:                      | (doall             | (map              | todo-item       | (sub> | ctx | :todos-by-status | route-status)))])) |
| ./src/keechma_todomvc/components/todo_list.cljs:31:                      | :subscription-deps | [:todos-by-status |                 |       |     |                  |                    |
| ./src/keechma_todomvc/subscriptions.cljs:48:(def                         | subscriptions      | {:todos-by-status | todos-by-status |       |     |                  |                    |
| ./resources/public/js/dev/keechma_todomvc/components/todo_list.cljs:18:- | `:todos-by-status` | returns           | `todos`         | with  | a   | `status`         |                    |
| ./resources/public/js/dev/keechma_todomvc/components/todo_list.cljs:26:  | (doall             | (map              | todo-item       | (sub> | ctx | :todos-by-status | route-status)))])) |
| ./resources/public/js/dev/keechma_todomvc/components/todo_list.cljs:31:  | :subscription-deps | [:todos-by-status |                 |       |     |                  |                    |
| ./resources/public/js/dev/keechma_todomvc/subscriptions.cljs:48:(def     | subscriptions      | {:todos-by-status | todos-by-status |       |     |                  |                    |


**** dropbox in org
#+begin_src sh  
grep --include=\*.cljs -rnw ./ -e "reagent.core"
#+end_src       

#+RESULTS:
| ./src/keechma_todomvc/components/new_todo.cljs:5:                          | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/reagent/core.cljs:1:(ns                       | reagent.core     |                 |            |         |        |           |
| ./target/public/cljs-out/dev/reagent/core.cljs:2:                          | (:require-macros | [reagent.core]) |            |         |        |           |
| ./target/public/cljs-out/dev/keechma_todomvc/components/new_todo.cljs:5:   | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:5:  | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/keechma/app_state/react_native_router.cljs:3: | [reagent.core    | :as             | r]         |         |        |           |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:2:                     | (:require        | [reagent.core   | :as        | reagent | :refer | [cursor]] |

*** I
#+begin_src eshell :tangle no :dir /home/buyn/Dev/ClojureScript/grom.org
tree -I "node_modules|.venv|__pycache__|public/js"

 #+end_src

 #+RESULTS:
 #+begin_example
 .
 ├── grom.org
 ├── package.json
 ├── package-lock.json
 ├── public
 │   ├── css
 │   │   └── style.css
 │   └── index.html
 ├── README.md
 ├── README.md~1
 ├── resources
 │   └── public
 ├── shadow-cljs.edn
 └── src
     └── ueava
         └── core.cljs

 7 directories, 9 files
 #+end_example

